Adição de diagramas
